SELECT 人員版raw.員編1, 人員版raw.人員1, 人員版raw.班別, 人員版raw.配班組合, 人員版raw.店號, 人員版raw.門市, 人員版raw.負責業務, 人員版raw.縣市, 人員版raw.區域, 人員版raw.年, 人員版raw.月,
	 [人員版raw]![年] & [人員版raw]![月] & [人員版raw]![員編1] AS 年月員編, 人員版raw.店人力, Count(人員版raw.月店號) AS 天數, Avg(人員版raw.業績) AS 人員日均績, Avg(區域日業績.金額之總計) AS 區日均績,
	 門市月業績.金額之總計 AS 門市月業績, 區域月業績.金額之總計 AS 區月業績, [人員日均績]/[區日均績]*[區月業績]/[門市月業績] AS 戰鬥力, 門市日均績.金額之平均 AS 前一年日均績,
	 ([人員日均績]-[前一年日均績])/[前一年日均績] AS 成長率, "" AS [加權成長率(每月)], "" AS [加權成長率(人員)], 歷年最高日均績.金額之平均之最大值 AS 歷年最高日均績,
	 ([人員日均績]-[歷年最高日均績])/[歷年最高日均績] AS 最佳成長率, "" AS [加權最佳成長率(每月)], "" AS [加權最佳成長率(人員)]

FROM ((((人員版raw 
	LEFT JOIN 區域月業績 
		ON (人員版raw.年 = 區域月業績.年) AND (人員版raw.月 = 區域月業績.月) AND (人員版raw.區域 = 區域月業績.區域)) 
	LEFT JOIN 門市月業績 
		ON (人員版raw.年 = 門市月業績.年) AND (人員版raw.月店號 = 門市月業績.月店號)) 
	LEFT JOIN 區域日業績 
		ON (人員版raw.上班日 = 區域日業績.日期) AND (人員版raw.區域 = 區域日業績.區域)) 
	LEFT JOIN 門市日均績 
		ON (人員版raw.年 = 門市日均績.[後一年]) AND (人員版raw.月店號 = 門市日均績.月店號)) 
	LEFT JOIN 歷年最高日均績 
		ON (人員版raw.月 = 歷年最高日均績.月) AND (人員版raw.店號 = 歷年最高日均績.店號)

GROUP BY 人員版raw.員編1, 人員版raw.人員1, 人員版raw.班別, 人員版raw.配班組合, 人員版raw.店號, 人員版raw.門市, 人員版raw.負責業務, 人員版raw.縣市,
	 人員版raw.區域, 人員版raw.年, 人員版raw.月, [人員版raw]![年] & [人員版raw]![月] & [人員版raw]![員編1], 人員版raw.店人力, 門市月業績.金額之總計, 
	區域月業績.金額之總計, [人員日均績]/[區日均績]*[區月業績]/[門市月業績], 門市日均績.金額之平均, ([人員日均績]-[前一年日均績])/[前一年日均績], 
	歷年最高日均績.金額之平均之最大值, ([人員日均績]-[歷年最高日均績])/[歷年最高日均績]

ORDER BY 人員版raw.員編1, 人員版raw.年, 人員版raw.月;